tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
#include "../Esp32BaseProfile.h"

#include "Esp32BaseWeb.h"

#if ESP32BASE_ENABLE_FS
#include "../runtime/Esp32BaseStorage.h"
#endif
#if ESP32BASE_ENABLE_RECORD_STORE
#include "../runtime/Esp32BaseRecordStore.h"
#endif
#ifndef ESP32BASE_WEB_NATIVE_TEST
#include "../core/Esp32BaseLog.h"
#endif
#if ESP32BASE_ENABLE_BUS
#include "../runtime/Esp32BaseBus.h"
#endif

#include <stdio.h>
#include <string.h>

namespace {
Esp32BaseWeb::AfterFormatFsCallback g_afterFormatFsCallback = nullptr;
void* g_afterFormatFsCallbackUser = nullptr;

void dispatchToolsFormatFsSuccess(bool mountSuccess,
                                  bool fileLogReloadSuccess,
                                  uint8_t businessRecordStoreCount,
                                  uint8_t businessRecordStoreReloadedCount,
                                  bool publishEvent) {
    Esp32BaseWeb::FormatFsResult result = {
        "tools",
        true,
        mountSuccess,
        fileLogReloadSuccess,
        businessRecordStoreCount,
        businessRecordStoreReloadedCount,
        businessRecordStoreCount == businessRecordStoreReloadedCount
    };
    if (g_afterFormatFsCallback) {
        g_afterFormatFsCallback(result, g_afterFormatFsCallbackUser);
    }
#if ESP32BASE_ENABLE_BUS
    if (publishEvent) {
        char data[240];
        snprintf(data,
                 sizeof(data),
                 "{\"source\":\"tools\",\"formatSuccess\":true,\"mountSuccess\":%s,\"fileLogReloadSuccess\":%s,\"businessRecordStoreCount\":%u,\"businessRecordStoreReloadedCount\":%u,\"businessRecordStoresReloadSuccess\":%s}",
                 mountSuccess ? "true" : "false",
                 fileLogReloadSuccess ? "true" : "false",
                 static_cast<unsigned>(businessRecordStoreCount),
                 static_cast<unsigned>(businessRecordStoreReloadedCount),
                 businessRecordStoreCount == businessRecordStoreReloadedCount ? "true" : "false");
        Esp32BaseBus::publish(Esp32BaseWeb::EVENT_TOOLS_FORMAT_FS_SUCCESS, data);
    }
#else
    (void)publishEvent;
#endif
}
}

void Esp32BaseWeb::setAfterFormatFsCallback(AfterFormatFsCallback cb, void* user) {
    g_afterFormatFsCallback = cb;
    g_afterFormatFsCallbackUser = cb ? user : nullptr;
}

void Esp32BaseWeb::clearAfterFormatFsCallback() {
    setAfterFormatFsCallback(nullptr, nullptr);
}

#if ESP32BASE_WEB_NATIVE_TEST

#include <algorithm>
#include <cctype>
#include <cstdio>
#include <cstring>

namespace {

struct NativeTestParam {
    std::string name;
    std::string value;
};

struct NativeTestRoute {
    std::string path;
    std::string title;
    Esp32BaseWeb::Method method;
    Esp32BaseWeb::Handler handler;
    bool appPage;
};

struct NativeTestStaticAsset {
    std::string path;
    std::string contentType;
    const uint8_t* data;
    size_t len;
    uint32_t cacheMaxAgeSec;
    bool authRequired;
    bool gzipEncoded;
};

struct NativeTestState {
    Esp32BaseWeb::Method method = Esp32BaseWeb::METHOD_UNKNOWN;
    std::string path;
    std::vector<NativeTestParam> params;
    std::string body;
    bool requestActive = false;
    bool authenticated = true;
    bool sameOrigin = true;
    bool authEnabled = true;
    std::string authUser = "admin";
    std::string authPass = "admin";
    std::string deviceName = "Esp32Base";
    std::string homePath;
    Esp32BaseWeb::HomeMode homeMode = Esp32BaseWeb::HOME_ESP32BASE;
    Esp32BaseWeb::SystemNavMode systemNavMode = Esp32BaseWeb::SYSTEM_NAV_SECTION;
    Esp32BaseWeb::FooterBarMode footerBarMode = Esp32BaseWeb::FOOTER_BAR_FULL;
    std::vector<NativeTestRoute> routes;
    std::vector<NativeTestStaticAsset> staticAssets;
    std::vector<Esp32BaseWeb::NativeTestHeader> navItems;
    Esp32BaseWeb::NativeTestResponse response{0, "", "", {}, false, false};
};

NativeTestState& nativeState() {
    static NativeTestState state;
    return state;
}

const char* nativeMethodName(Esp32BaseWeb::Method method) {
    switch (method) {
        case Esp32BaseWeb::METHOD_GET: return "GET";
        case Esp32BaseWeb::METHOD_POST: return "POST";
        case Esp32BaseWeb::METHOD_ANY: return "ANY";
        case Esp32BaseWeb::METHOD_UNKNOWN:
        default: return "UNKNOWN";
    }
}

bool headerNameEquals(const std::string& a, const char* b) {
    if (!b || a.size() != std::strlen(b)) {
        return false;
    }
    for (size_t i = 0; i < a.size(); ++i) {
        if (std::tolower(static_cast<unsigned char>(a[i])) !=
            std::tolower(static_cast<unsigned char>(b[i]))) {
            return false;
        }
    }
    return true;
}

bool copyTo(const std::string& value, char* out, size_t len) {
    if (!out || len == 0) {
        return false;
    }
    const size_t take = std::min(len - 1U, value.size());
    std::memcpy(out, value.data(), take);
    out[take] = '\0';
    return value.size() < len;
}

NativeTestParam* findParam(const char* name) {
    if (!name) {
        return nullptr;
    }
    NativeTestState& state = nativeState();
    for (NativeTestParam& param : state.params) {
        if (param.name == name) {
            return &param;
        }
    }
    return nullptr;
}

void clearResponse() {
    NativeTestState& state = nativeState();
    state.response.code = 0;
    state.response.contentType.clear();
    state.response.body.clear();
    state.response.headers.clear();
    state.response.started = false;
    state.response.ended = false;
}

void setResponse(int code, const char* contentType, const char* body, bool ended) {
    NativeTestState& state = nativeState();
    state.response.code = code;
    state.response.contentType = contentType ? contentType : "";
    state.response.body = body ? body : "";
    state.response.started = true;
    state.response.ended = ended;
}

void setResponseHeader(const char* name, const char* value) {
    if (!name || !name[0]) {
        return;
    }
    NativeTestState& state = nativeState();
    for (Esp32BaseWeb::NativeTestHeader& header : state.response.headers) {
        if (headerNameEquals(header.name, name)) {
            header.value = value ? value : "";
            return;
        }
    }
    state.response.headers.push_back({name, value ? value : ""});
}

bool validRoutePath(const char* path) {
    return path && path[0] == '/' && std::strlen(path) < 48;
}

