tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
bool validContentType(const char* contentType) {
    return contentType && contentType[0] && std::strlen(contentType) <= 63;
}

bool routeMatches(Esp32BaseWeb::Method routeMethod, Esp32BaseWeb::Method requestMethod) {
    return routeMethod == Esp32BaseWeb::METHOD_ANY || routeMethod == requestMethod;
}

bool addNativeRoute(const char* path, const char* title, Esp32BaseWeb::Method method,
                    Esp32BaseWeb::Handler handler, bool appPage) {
    if (!validRoutePath(path) || !handler ||
        (method != Esp32BaseWeb::METHOD_GET && method != Esp32BaseWeb::METHOD_POST &&
         method != Esp32BaseWeb::METHOD_ANY)) {
        return false;
    }
    nativeState().routes.push_back({path, title ? title : "", method, handler, appPage});
    return true;
}

NativeTestStaticAsset* findNativeStaticAsset(const char* path) {
    if (!path) {
        return nullptr;
    }
    for (NativeTestStaticAsset& asset : nativeState().staticAssets) {
        if (asset.path == path) {
            return &asset;
        }
    }
    return nullptr;
}

void sendEscapedHtmlNative(const char* text);
void sendEscapedJsonNative(const char* text);

void sendSimpleWrappedText(const char* before, const char* text, const char* after) {
    Esp32BaseWeb::sendChunk(before);
    sendEscapedHtmlNative(text ? text : "");
    Esp32BaseWeb::sendChunk(after);
}

void sendEscapedHtmlNative(const char* text) {
    if (!text) {
        return;
    }
    for (const char* p = text; *p; ++p) {
        switch (*p) {
            case '&': Esp32BaseWeb::sendChunk("&amp;"); break;
            case '<': Esp32BaseWeb::sendChunk("&lt;"); break;
            case '>': Esp32BaseWeb::sendChunk("&gt;"); break;
            case '"': Esp32BaseWeb::sendChunk("&quot;"); break;
            case '\'': Esp32BaseWeb::sendChunk("&#39;"); break;
            default: {
                char one[2] = {*p, '\0'};
                Esp32BaseWeb::sendChunk(one);
                break;
            }
        }
    }
}

void sendEscapedJsonNative(const char* text) {
    if (!text) {
        return;
    }
    for (const char* p = text; *p; ++p) {
        switch (*p) {
            case '"': Esp32BaseWeb::sendChunk("\\\""); break;
            case '\\': Esp32BaseWeb::sendChunk("\\\\"); break;
            case '\n': Esp32BaseWeb::sendChunk("\\n"); break;
            case '\r': Esp32BaseWeb::sendChunk("\\r"); break;
            case '\t': Esp32BaseWeb::sendChunk("\\t"); break;
            default:
                if (static_cast<unsigned char>(*p) < 0x20) {
                    char buf[7];
                    std::snprintf(buf, sizeof(buf), "\\u%04x", static_cast<unsigned char>(*p));
                    Esp32BaseWeb::sendChunk(buf);
                } else {
                    char one[2] = {*p, '\0'};
                    Esp32BaseWeb::sendChunk(one);
                }
                break;
        }
    }
}

const char* configuredHomePathNative() {
    NativeTestState& state = nativeState();
    if (!state.homePath.empty()) {
        return state.homePath.c_str();
    }
    for (const Esp32BaseWeb::NativeTestHeader& item : state.navItems) {
        if (item.name == "/index") {
            return item.name.c_str();
        }
    }
    for (const NativeTestRoute& route : state.routes) {
        if (route.appPage && route.path == "/index") {
            return route.path.c_str();
        }
    }
    for (const Esp32BaseWeb::NativeTestHeader& item : state.navItems) {
        if (!item.name.empty()) {
            return item.name.c_str();
        }
    }
    for (const NativeTestRoute& route : state.routes) {
        if (route.appPage) {
            return route.path.c_str();
        }
    }
    return "/esp32base/status";
}

void appendUrlEncodedNative(std::string& output, const std::string& value) {
    static const char hex[] = "0123456789ABCDEF";
    for (unsigned char c : value) {
        const bool unreserved = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
                                (c >= '0' && c <= '9') || c == '-' || c == '.' ||
                                c == '_' || c == '~';
        if (unreserved) {
            output.push_back(static_cast<char>(c));
        } else {
            output.push_back('%');
            output.push_back(hex[(c >> 4) & 0x0F]);
            output.push_back(hex[c & 0x0F]);
        }
    }
}

void nativeStatusRedirect() {
    std::string location = "/esp32base/status";
    NativeTestState& state = nativeState();
    for (size_t i = 0; i < state.params.size(); ++i) {
        location.push_back(i == 0 ? '?' : '&');
        appendUrlEncodedNative(location, state.params[i].name);
        location.push_back('=');
        appendUrlEncodedNative(location, state.params[i].value);
    }
    setResponseHeader("Location", location.c_str());
    setResponseHeader("Cache-Control", "no-store");
    setResponse(302, "text/plain", "", true);
}

void nativeSimplePage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader("Esp32Base");
    Esp32BaseWeb::sendChunk("<h1>Esp32Base page</h1>");
    Esp32BaseWeb::sendFooter();
}

void nativeStatusPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader("Status");
    Esp32BaseWeb::sendChunk("<h1>Status</h1><section><h2>System settings</h2><a href='/esp32base/system'>Open System</a></section>");
    Esp32BaseWeb::sendFooter();
}

void nativeSystemPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader("System");
    Esp32BaseWeb::sendChunk("<h1>System</h1>");
    static const char* actions[] = {
        "hostname", "wifi-recovery", "filelog", "footer-bar", "reboot", "watchdog-trip-reset",
        "app-config-defaults", "format-fs", "logs-clear", "business-records-clear"
    };
    for (const char* action : actions) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/esp32base/system/");
        Esp32BaseWeb::sendChunk(action);
        Esp32BaseWeb::sendChunk("'></form>");
    }
    Esp32BaseWeb::sendFooter();
}

void nativeRootRedirect() {
    NativeTestState& state = nativeState();
    const char* home = state.homeMode == Esp32BaseWeb::HOME_ESP32BASE
                           ? "/esp32base/status"
                           : configuredHomePathNative();
    if (state.homeMode != Esp32BaseWeb::HOME_ESP32BASE && std::strcmp(home, "/") == 0) {
        for (auto it = state.routes.rbegin(); it != state.routes.rend(); ++it) {
            if (it->path == "/" && it->handler != nativeRootRedirect &&
                routeMatches(it->method, Esp32BaseWeb::METHOD_GET)) {
                it->handler();
                return;
            }
        }
        home = "/esp32base/status";
    }
    setResponseHeader("Location", home);
    setResponse(302, "text/plain", "", true);
}

void registerNativeBuiltinRoutes() {
    addNativeRoute("/", nullptr, Esp32BaseWeb::METHOD_GET, nativeRootRedirect, false);
    addNativeRoute("/esp32base", nullptr, Esp32BaseWeb::METHOD_GET, nativeStatusRedirect, false);
    addNativeRoute("/esp32base/", nullptr, Esp32BaseWeb::METHOD_GET, nativeStatusRedirect, false);
    addNativeRoute("/esp32base/status", "Status", Esp32BaseWeb::METHOD_GET, nativeStatusPage, false);
    addNativeRoute("/esp32base/system", "System", Esp32BaseWeb::METHOD_GET, nativeSystemPage, false);
    addNativeRoute("/esp32base/logs", "System Logs", Esp32BaseWeb::METHOD_GET, nativeSimplePage, false);
    addNativeRoute("/esp32base/app-config", "App Config", Esp32BaseWeb::METHOD_GET, nativeSimplePage, false);
    addNativeRoute("/esp32base/wifi", "WiFi", Esp32BaseWeb::METHOD_GET, nativeSimplePage, false);
    addNativeRoute("/esp32base/auth", "Auth", Esp32BaseWeb::METHOD_GET, nativeSimplePage, false);
    addNativeRoute("/esp32base/ota", "OTA", Esp32BaseWeb::METHOD_GET, nativeSimplePage, false);
    addNativeRoute("/esp32base/fs", "File system", Esp32BaseWeb::METHOD_GET, nativeSimplePage, false);
}

