tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
} // namespace

bool Esp32BaseWeb::begin() {
    return true;
}

void Esp32BaseWeb::handle() {
}

bool Esp32BaseWeb::isReady() {
    return true;
}

bool Esp32BaseWeb::startLocked() {
    return false;
}

void Esp32BaseWeb::setDefaultAuth(const char* user, const char* pass) {
    if (user && user[0]) {
        nativeState().authUser = user;
    }
    if (pass && pass[0]) {
        nativeState().authPass = pass;
    }
}

bool Esp32BaseWeb::isAuthEnabled() {
    return nativeState().authEnabled;
}

void Esp32BaseWeb::setAuthEnabled(bool enabled) {
    nativeState().authEnabled = enabled;
}

bool Esp32BaseWeb::checkAuth() {
    NativeTestState& state = nativeState();
    if (!state.authEnabled || state.authenticated) {
        return true;
    }
    setResponseHeader("WWW-Authenticate", "Basic realm=\"Esp32Base\"");
    sendText(401, "Authentication Required");
    return false;
}

bool Esp32BaseWeb::checkPostAllowed(const char*) {
    NativeTestState& state = nativeState();
    if (state.method != METHOD_POST) {
        sendText(405, "Method Not Allowed");
        return false;
    }
    if (!checkAuth()) {
        return false;
    }
    if (!state.sameOrigin) {
        sendText(403, "Forbidden");
        return false;
    }
    return true;
}

bool Esp32BaseWeb::verifyAuth() {
    return !nativeState().authEnabled || nativeState().authenticated;
}

bool Esp32BaseWeb::verifyAuth(const char* user, const char* pass) {
    NativeTestState& state = nativeState();
    return user && pass && state.authUser == user && state.authPass == pass;
}

bool Esp32BaseWeb::saveAuth(const char* user, const char* pass) {
    if (!user || !user[0] || !pass || !pass[0]) {
        return false;
    }
    nativeState().authUser = user;
    nativeState().authPass = pass;
    return true;
}

bool Esp32BaseWeb::resetAuth() {
    nativeState().authUser = "admin";
    nativeState().authPass = "admin";
    nativeState().authenticated = true;
    return true;
}

bool Esp32BaseWeb::addRoute(const char* path, Method method, Handler handler) {
    return addNativeRoute(path, nullptr, method, handler, false);
}

bool Esp32BaseWeb::addPage(const char* path, const char* title, Handler handler) {
    return addNativeRoute(path, title, METHOD_GET, handler, true);
}

bool Esp32BaseWeb::addApi(const char* path, Handler handler) {
    return addRoute(path, METHOD_ANY, handler);
}

bool Esp32BaseWeb::addStaticAsset(const char* path, const char* contentType, const uint8_t* data, size_t len,
                                  uint32_t cacheMaxAgeSec, bool authRequired, bool gzipEncoded) {
    if (!validRoutePath(path) || !validContentType(contentType) || !data || len == 0 || findNativeStaticAsset(path)) {
        return false;
    }
    nativeState().staticAssets.push_back({path, contentType, data, len, cacheMaxAgeSec, authRequired, gzipEncoded});
    return true;
}

bool Esp32BaseWeb::addNavItem(const char* path, const char* title) {
    if (!validRoutePath(path) || !title || !title[0]) {
        return false;
    }
    nativeState().navItems.push_back({path, title});
    return true;
}

bool Esp32BaseWeb::setDeviceName(const char* name) {
    if (!name || !name[0]) {
        return false;
    }
    nativeState().deviceName = name;
    return true;
}

bool Esp32BaseWeb::setHomePath(const char* path) {
    if (!validRoutePath(path)) {
        return false;
    }
    nativeState().homePath = path;
    return true;
}

void Esp32BaseWeb::setHomeMode(HomeMode mode) {
    nativeState().homeMode = mode;
}

void Esp32BaseWeb::setSystemNavMode(SystemNavMode mode) {
    nativeState().systemNavMode = mode;
}

bool Esp32BaseWeb::setFooterBarMode(FooterBarMode mode) {
    nativeState().footerBarMode = mode;
    return true;
}

Esp32BaseWeb::FooterBarMode Esp32BaseWeb::footerBarMode() {
    return nativeState().footerBarMode;
}

const char* Esp32BaseWeb::footerBarModeName() {
    switch (nativeState().footerBarMode) {
        case FOOTER_BAR_OFF: return "Off";
        case FOOTER_BAR_STATUS_ONLY: return "Status only";
        case FOOTER_BAR_FULL:
        default: return "Links + status";
    }
}

bool Esp32BaseWeb::setBuiltinLabel(BuiltinPage, const char*) {
    return true;
}

void Esp32BaseWeb::setHeadExtraCallback(Handler) {
}

Esp32BaseWeb::Method Esp32BaseWeb::currentMethod() {
    return nativeState().requestActive ? nativeState().method : METHOD_UNKNOWN;
}

bool Esp32BaseWeb::isMethod(Method method) {
    const Method current = currentMethod();
    return method == METHOD_ANY ? current != METHOD_UNKNOWN : current == method;
}

const char* Esp32BaseWeb::currentMethodName() {
    return nativeMethodName(currentMethod());
}

bool Esp32BaseWeb::hasParam(const char* name) {
    return findParam(name) != nullptr;
}

bool Esp32BaseWeb::getParam(const char* name, char* out, size_t len) {
    NativeTestParam* param = findParam(name);
    if (!param || !out || len == 0) {
        return false;
    }
    return copyTo(param->value, out, len);
}

bool Esp32BaseWeb::getRequestBody(char* out, size_t len) {
    if (!out || len == 0) {
        return false;
    }
    return copyTo(nativeState().body, out, len);
}

void Esp32BaseWeb::sendHeader(const char* title) {
    if (!beginResponse(200, "text/html; charset=utf-8", nullptr)) {
        return;
    }
    sendChunk("<!doctype html><html><head><title>");
    writeHtmlEscaped(title ? title : nativeState().deviceName.c_str());
    sendChunk("</title></head><body><main class='page'>");
}

void Esp32BaseWeb::sendFooter() {
    if (nativeState().footerBarMode == FOOTER_BAR_FULL) {
        sendChunk("<footer><a href='/esp32base/status'>Status</a><a href='/esp32base/system'>System</a></footer>");
    } else if (nativeState().footerBarMode == FOOTER_BAR_STATUS_ONLY) {
        sendChunk("<footer>Free heap: test</footer>");
    }
    sendChunk("</main></body></html>");
    endResponse();
}

void Esp32BaseWeb::sendPageTitle(const char* title, const char* subtitle) {
    sendSimpleWrappedText("<header class='pagehead'><h1>", title, "</h1>");
    if (subtitle && subtitle[0]) {
        sendSimpleWrappedText("<p>", subtitle, "</p>");
    }
    sendChunk("</header>");
}

