tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
void Esp32BaseWeb::beginPanel(const char* title) {
    sendChunk("<section class='panel'>");
    if (title && title[0]) {
        sendSimpleWrappedText("<h2>", title, "</h2>");
    }
}

void Esp32BaseWeb::endPanel() {
    sendChunk("</section>");
}

void Esp32BaseWeb::sendNotice(UiTone, const char* title, const char* message) {
    sendSimpleWrappedText("<div class='notice'><b>", title, "</b>");
    if (message && message[0]) {
        sendSimpleWrappedText("<br>", message, "");
    }
    sendChunk("</div>");
}

void Esp32BaseWeb::sendResultNotice(const ResultNotice* notices, uint8_t count) {
    if (!notices) {
        return;
    }
    char value[32];
    for (uint8_t i = 0; i < count; ++i) {
        const ResultNotice& notice = notices[i];
        if (!notice.param || !hasParam(notice.param)) {
            continue;
        }
        if (notice.value && notice.value[0]) {
            if (!getParam(notice.param, value, sizeof(value)) || std::strcmp(value, notice.value) != 0) {
                continue;
            }
        }
        sendNotice(notice.tone, notice.title, notice.message);
        return;
    }
}

void Esp32BaseWeb::beginMetricGrid() {
    sendChunk("<div class='metrics'>");
}

void Esp32BaseWeb::sendMetric(const char* label, const char* value, const char* help) {
    sendSimpleWrappedText("<div class='metric'><b>", value, "</b><span>");
    writeHtmlEscaped(label ? label : "");
    if (help && help[0]) {
        sendChunk(" ");
        writeHtmlEscaped(help);
    }
    sendChunk("</span></div>");
}

void Esp32BaseWeb::endMetricGrid() {
    sendChunk("</div>");
}

void Esp32BaseWeb::sendInfoRowCompact(const char* title, const char* help, const char* value) {
    sendSimpleWrappedText("<div class='urow'><b>", title, "</b>");
    if (help && help[0]) {
        sendSimpleWrappedText("<small>", help, "</small>");
    }
    if (value && value[0]) {
        sendSimpleWrappedText("<span>", value, "</span>");
    }
    sendChunk("</div>");
}

void Esp32BaseWeb::sendInfoRowCompactLink(const char* title, const char* help, const char* value,
                                          const char* href, const char* label, UiTone) {
    sendInfoRowCompact(title, help, value);
    sendChunk("<a href='");
    writeHtmlEscaped(href ? href : "#");
    sendChunk("'>");
    writeHtmlEscaped(label ? label : "");
    sendChunk("</a>");
}

void Esp32BaseWeb::sendInfoRowCompactForm(const char* title, const char* help, const char* value,
                                          const char* action, const char* label,
                                          const char*, const char*, UiTone) {
    sendInfoRowCompact(title, help, value);
    sendChunk("<form method='post' action='");
    writeHtmlEscaped(action ? action : "");
    sendChunk("'><input type='submit' value='");
    writeHtmlEscaped(label ? label : "");
    sendChunk("'></form>");
}

void Esp32BaseWeb::sendInfoRowInlineEdit(const char*, const char* title, const char* help, const char* value,
                                         const char* action, const char* inputName, const char* inputValue,
                                         const char* label, UiTone tone) {
    sendInfoRowCompactForm(title, help, value, action, label, inputName, inputValue, tone);
}

void Esp32BaseWeb::sendInfoRowDialogForm(const char*, const char*, const char* title,
                                         const char* help, const char* value, const char* action,
                                         const char*, const char* label, UiTone tone) {
    sendInfoRowCompactForm(title, help, value, action, label, nullptr, nullptr, tone);
}

void Esp32BaseWeb::sendPagination(const Pagination&) {
    sendChunk("<div class='pagination'></div>");
}

bool Esp32BaseWeb::isAjaxRequest() {
    NativeTestParam* param = findParam("_ajax");
    return param && param->value == "1";
}

void Esp32BaseWeb::sendAjaxReplace(const char* targetId, const char* html, const char* noticeTitle,
                                   UiTone, bool close) {
    if (!beginResponse(200, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"ok\":true,\"target\":\"");
    writeJsonEscaped(targetId ? targetId : "");
    sendChunk("\",\"html\":\"");
    writeJsonEscaped(html ? html : "");
    sendChunk("\",\"close\":");
    sendChunk(close ? "true" : "false");
    if (noticeTitle && noticeTitle[0]) {
        sendChunk(",\"notice\":{\"title\":\"");
        writeJsonEscaped(noticeTitle);
        sendChunk("\"}");
    }
    sendChunk("}");
    endResponse();
}

void Esp32BaseWeb::sendAjaxError(int code, const char* error) {
    if (!beginResponse(code, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"ok\":false,\"error\":\"");
    writeJsonEscaped(error ? error : "Action failed");
    sendChunk("\"}");
    endResponse();
}

bool Esp32BaseWeb::sendResponseHeader(const char* name, const char* value) {
    if (!nativeState().requestActive || nativeState().response.started || !name || !name[0] || !value) {
        return false;
    }
    setResponseHeader(name, value);
    return true;
}

bool Esp32BaseWeb::beginResponse(int code, const char* contentType, const char* filename) {
    if (!nativeState().requestActive || !contentType || !contentType[0]) {
        return false;
    }
    setResponse(code, contentType, "", false);
    if (filename && filename[0]) {
        std::string disposition = "attachment; filename=\"";
        disposition += filename;
        disposition += "\"";
        setResponseHeader("Content-Disposition", disposition.c_str());
    }
    return true;
}

bool Esp32BaseWeb::beginText(int code) {
    return beginResponse(code, "text/plain; charset=utf-8", nullptr);
}

bool Esp32BaseWeb::beginCsv(int code, const char* filename) {
    return beginResponse(code, "text/csv; charset=utf-8", filename);
}

void Esp32BaseWeb::endResponse() {
    nativeState().response.ended = true;
}

void Esp32BaseWeb::sendChunk(const char* text) {
    if (!text || !nativeState().response.started) {
        return;
    }
    nativeState().response.body += text;
}

void Esp32BaseWeb::sendBytes(const uint8_t* data, size_t len) {
    if ((!data && len > 0) || !nativeState().response.started) {
        return;
    }
    nativeState().response.body.append(reinterpret_cast<const char*>(data), len);
}

