tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
void Esp32BaseWeb::writeHtmlEscaped(const char* text) {
    sendEscapedHtmlNative(text);
}

void Esp32BaseWeb::writeCsvEscaped(const char* text) {
    sendChunk("\"");
    if (text) {
        for (const char* p = text; *p; ++p) {
            if (*p == '"') {
                sendChunk("\"\"");
            } else {
                char one[2] = {*p, '\0'};
                sendChunk(one);
            }
        }
    }
    sendChunk("\"");
}

void Esp32BaseWeb::sendText(int code, const char* text) {
    setResponse(code, "text/plain", text ? text : "", true);
}

void Esp32BaseWeb::sendHtml(int code, const char* html) {
    setResponse(code, "text/html", html ? html : "", true);
}

void Esp32BaseWeb::sendJson(int code, const char* json) {
    setResponse(code, "application/json", json ? json : "{}", true);
}

void Esp32BaseWeb::redirectSeeOther(const char* url) {
    setResponseHeader("Location", url ? url : "/esp32base/status");
    setResponseHeader("Cache-Control", "no-store");
    setResponse(303, "text/plain", "", true);
}

void Esp32BaseWeb::beginJson(int code) {
    if (beginResponse(code, "application/json", nullptr)) {
        sendChunk("{");
    }
}

void Esp32BaseWeb::writeJsonEscaped(const char* text) {
    sendEscapedJsonNative(text);
}

void Esp32BaseWeb::endJson() {
    sendChunk("}");
    endResponse();
}

void Esp32BaseWeb::nativeTestReset() {
    clearAfterFormatFsCallback();
    NativeTestState& state = nativeState();
    state.method = METHOD_UNKNOWN;
    state.path.clear();
    state.params.clear();
    state.body.clear();
    state.requestActive = false;
    state.authenticated = true;
    state.sameOrigin = true;
    state.authEnabled = true;
    state.authUser = "admin";
    state.authPass = "admin";
    state.deviceName = "Esp32Base";
    state.homePath.clear();
    state.homeMode = HOME_ESP32BASE;
    state.systemNavMode = SYSTEM_NAV_SECTION;
    state.footerBarMode = FOOTER_BAR_FULL;
    state.routes.clear();
    state.staticAssets.clear();
    state.navItems.clear();
    clearResponse();
    registerNativeBuiltinRoutes();
}

void Esp32BaseWeb::nativeTestBeginRequest(Method method, const char* path) {
    NativeTestState& state = nativeState();
    state.method = method;
    state.path = path && path[0] ? path : "/";
    state.params.clear();
    state.body.clear();
    state.requestActive = true;
    clearResponse();
}

void Esp32BaseWeb::nativeTestSetParam(const char* name, const char* value) {
    if (!name || !name[0]) {
        return;
    }
    NativeTestParam* existing = findParam(name);
    if (existing) {
        existing->value = value ? value : "";
        return;
    }
    nativeState().params.push_back({name, value ? value : ""});
}

void Esp32BaseWeb::nativeTestSetBody(const char* body) {
    nativeState().body = body ? body : "";
}

void Esp32BaseWeb::nativeTestSetAuthenticated(bool authenticated) {
    nativeState().authenticated = authenticated;
}

void Esp32BaseWeb::nativeTestSetSameOrigin(bool sameOrigin) {
    nativeState().sameOrigin = sameOrigin;
}

bool Esp32BaseWeb::nativeTestRun(Handler handler) {
    if (!handler) {
        return false;
    }
    NativeTestState& state = nativeState();
    if (!state.requestActive) {
        nativeTestBeginRequest(METHOD_GET, "/");
    }
    handler();
    return true;
}

bool Esp32BaseWeb::nativeTestDispatch(const char* path, Method method) {
    NativeTestState& state = nativeState();
    for (const NativeTestRoute& route : state.routes) {
        if (route.path == (path ? path : "") && routeMatches(route.method, method)) {
            state.method = method;
            state.path = path && path[0] ? path : "/";
            state.requestActive = true;
            clearResponse();
            route.handler();
            return true;
        }
    }
    NativeTestStaticAsset* asset = findNativeStaticAsset(path);
    if (asset && method == METHOD_GET) {
        state.method = method;
        state.path = path && path[0] ? path : "/";
        state.requestActive = true;
        clearResponse();
        if (asset->authRequired && !checkAuth()) {
            return true;
        }
        char cacheControl[40];
        if (asset->cacheMaxAgeSec > 0) {
            std::snprintf(cacheControl, sizeof(cacheControl), "%s, max-age=%lu",
                          asset->authRequired ? "private" : "public",
                          static_cast<unsigned long>(asset->cacheMaxAgeSec));
        } else {
            std::snprintf(cacheControl, sizeof(cacheControl), "no-store");
        }
        setResponseHeader("Cache-Control", cacheControl);
        setResponseHeader("X-Content-Type-Options", "nosniff");
        if (asset->gzipEncoded) {
            setResponseHeader("Content-Encoding", "gzip");
            setResponseHeader("Vary", "Accept-Encoding");
        }
        setResponse(200, asset->contentType.c_str(), "", true);
        state.response.body.assign(reinterpret_cast<const char*>(asset->data), asset->len);
        return true;
    }
    state.method = method;
    state.path = path && path[0] ? path : "/";
    state.requestActive = true;
    clearResponse();
    sendText(404, "Not found");
    return false;
}

const Esp32BaseWeb::NativeTestResponse& Esp32BaseWeb::nativeTestResponse() {
    return nativeState().response;
}

const char* Esp32BaseWeb::nativeTestResponseHeader(const char* name) {
    static const char empty[] = "";
    if (!name) {
        return empty;
    }
    for (const NativeTestHeader& header : nativeState().response.headers) {
        if (headerNameEquals(header.name, name)) {
            return header.value.c_str();
        }
    }
    return empty;
}

void Esp32BaseWeb::nativeTestNotifyToolsFormatFsSuccess(bool mountSuccess, bool fileLogReloadSuccess) {
    dispatchToolsFormatFsSuccess(mountSuccess, fileLogReloadSuccess, 0, 0, false);
}

#elif ESP32BASE_ENABLE_WEB

#include "internal/WebInternal.h"

using namespace esp32base_web;

namespace esp32base_web {
void notifyToolsFormatFsSuccess(bool mountSuccess,
                                bool fileLogReloadSuccess,
                                uint8_t businessRecordStoreCount,
                                uint8_t businessRecordStoreReloadedCount) {
    dispatchToolsFormatFsSuccess(mountSuccess,
                                 fileLogReloadSuccess,
                                 businessRecordStoreCount,
                                 businessRecordStoreReloadedCount,
                                 true);
}
#if ESP32BASE_ENABLE_RECORD_STORE
uint8_t businessRecordStoreCount() {
    return Esp32BaseStorage::recordStoreCount();
}

Esp32BaseRecordStore* businessRecordStoreAt(uint8_t index) {
    return Esp32BaseStorage::recordStoreAt(index);
}
#endif
}

