tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
bool Esp32BaseWeb::begin() {
    if (g_webReady) {
        return true;
    }
    if (g_startLocked) {
        return false;
    }
    const uint8_t appRoutes = routeCount(false);
    const uint8_t appPages = routeCount(true);
    const uint8_t staticAssets = staticAssetCount();
    ESP32BASE_LOG_D("web", "server_registering app_routes=%u app_pages=%u static_assets=%u",
                    static_cast<unsigned>(appRoutes),
                    static_cast<unsigned>(appPages),
                    static_cast<unsigned>(staticAssets));
    if (!loadStoredAuth()) {
        if (!applyDefaultAuth()) {
            g_startLocked = true;
            ESP32BASE_LOG_E("web", "auth_default_missing action=server_not_started");
            return false;
        }
#if ESP32BASE_WEB_ALLOW_INSECURE_DEFAULT_AUTH
        if (!g_defaultAuthSet) {
            ESP32BASE_LOG_W("web", "auth_loaded user=%s password_set=%s source=insecure_builtin",
                            g_authUser,
                            g_authPass[0] ? "yes" : "no");
        } else
#endif
        {
            ESP32BASE_LOG_I("web", "auth_loaded user=%s password_set=%s source=default",
                            g_authUser,
                            g_authPass[0] ? "yes" : "no");
        }
    } else {
        g_startLocked = false;
    }
    g_footerBarMode = readFooterBarMode();
    g_server.collectHeaders(g_headerKeys, sizeof(g_headerKeys) / sizeof(g_headerKeys[0]));
    g_server.on("/", HTTP_GET, handleRootRedirect);
    g_server.on("/esp32base", HTTP_GET, handleStatusRedirect);
    g_server.on("/esp32base/", HTTP_GET, handleStatusRedirect);
    g_server.on("/esp32base/status", HTTP_GET, handleStatusPage);
    g_server.on("/esp32base/api/status", HTTP_GET, handleStatus);
    g_server.on("/esp32base/api/chip", HTTP_GET, handleChip);
    g_server.on("/esp32base/api/firmware", HTTP_GET, handleFirmware);
    g_server.on("/esp32base/api/hostname", HTTP_GET, handleHostnameApiGet);
    g_server.on("/esp32base/api/hostname", HTTP_POST, handleHostnameSubmit);
    g_server.on("/esp32base/wifi", HTTP_GET, handleWifiPage);
    g_server.on("/esp32base/wifi", HTTP_POST, handleWifiSubmit);
    g_server.on("/esp32base/api/wifi", HTTP_POST, handleWifiSubmit);
    g_server.on("/esp32base/api/wifi/retry", HTTP_POST, handleWifiRetry);
    g_server.on("/esp32base/api/wifi/clear", HTTP_POST, handleWifiClear);
    g_server.on("/esp32base/logs", HTTP_GET, handleLogsPage);
    g_server.on("/esp32base/logs/raw", HTTP_GET, handleLogsRaw);
    g_server.on("/esp32base/logs/clear", HTTP_POST, handleLogsClear);
#if ESP32BASE_ENABLE_FS
    g_server.on("/esp32base/fs", HTTP_GET, handleFsPage);
    g_server.on("/esp32base/fs/check", HTTP_GET, handleFsCheckGet);
    g_server.on("/esp32base/fs/download", HTTP_GET, handleFsDownloadGet);
    g_server.on("/esp32base/fs/delete", HTTP_POST, handleFsDeletePost);
    g_server.on("/esp32base/fs/upload", HTTP_POST, handleFsUploadDone, handleFsUpload);
#endif
    g_server.on("/esp32base/auth", HTTP_GET, handleAuthPage);
    g_server.on("/esp32base/auth", HTTP_POST, handleAuthSubmit);
    g_server.on("/esp32base/system", HTTP_GET, handleToolsPage);
#if ESP32BASE_ENABLE_APP_CONFIG
    g_server.on("/esp32base/app-config", HTTP_GET, handleAppConfigPage);
    g_server.on("/esp32base/app-config", HTTP_POST, handleAppConfigSubmit);
    g_server.on("/esp32base/system/app-config-defaults", HTTP_POST, handleToolsAppConfigDefaultsPost);
#endif
    g_server.on("/esp32base/system/hostname", HTTP_POST, handleHostnameSubmit);
#if ESP32BASE_ENABLE_WIFI_RECOVERY_BUTTON
    g_server.on("/esp32base/system/wifi-recovery", HTTP_POST, handleToolsWifiRecoveryPost);
#endif
    g_server.on("/esp32base/system/filelog", HTTP_POST, handleToolsFileLogPost);
    g_server.on("/esp32base/system/footer-bar", HTTP_POST, handleToolsFooterBarPost);
    g_server.on("/esp32base/system/reboot", HTTP_POST, handleToolsRebootPost);
#if ESP32BASE_ENABLE_WATCHDOG
    g_server.on("/esp32base/system/watchdog-trip-reset", HTTP_POST, handleToolsWatchdogTripResetPost);
#endif
    g_server.on("/esp32base/system/format-fs", HTTP_POST, handleToolsFormatFsPost);
    g_server.on("/esp32base/system/logs-clear", HTTP_POST, handleToolsLogsClearPost);
#if ESP32BASE_ENABLE_RECORD_STORE
    g_server.on("/esp32base/system/business-records-clear", HTTP_POST, handleToolsBusinessRecordsClearPost);
#endif
    g_server.on("/esp32base/api/restart", HTTP_POST, handleRestart);
    g_server.on("/generate_204", HTTP_GET, handleCaptiveProbe);
    g_server.on("/hotspot-detect.html", HTTP_GET, handleCaptiveProbe);
    g_server.on("/ncsi.txt", HTTP_GET, handleCaptiveProbe);
    g_server.on("/favicon.ico", HTTP_GET, handleNoContent);
    g_server.on("/esp32base/ui.css", HTTP_GET, handleUiCss);
    g_server.on("/esp32base/ui.js", HTTP_GET, handleUiScript);
#if ESP32BASE_ENABLE_APP_CONFIG
    g_server.on("/esp32base/app-config.css", HTTP_GET, handleAppConfigCss);
#endif
#if ESP32BASE_ENABLE_OTA
    g_server.on("/esp32base/ota", HTTP_GET, handleOtaPage);
    g_server.on("/esp32base/ota", HTTP_POST, handleOtaUploadDone, handleOtaUpload);
    g_server.on("/esp32base/ota/raw", HTTP_POST, handleOtaUploadDone, handleOtaRawUpload);
    g_server.on("/esp32base/api/ota", HTTP_GET, handleOtaApi);
#endif
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (g_routes[i].handler && !g_routes[i].registered) {
            registerRoute(g_routes[i]);
        }
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_STATIC_ASSETS; ++i) {
        if (g_staticAssets[i].path[0] && !g_staticAssets[i].registered) {
            registerStaticAsset(g_staticAssets[i]);
        }
    }
    g_server.onNotFound(handleNotFound);
    g_server.begin();
    g_webReady = true;
    ESP32BASE_LOG_I("web", "server ready");
#if ESP32BASE_ENABLE_BUS
    Esp32BaseBus::publish(EVENT_READY, "");
#endif
    return true;
}

void Esp32BaseWeb::handle() {
    if (g_webReady) {
        g_activeUri[0] = '\0';
        g_currentMethod = METHOD_UNKNOWN;
        g_lastRequestMethod = METHOD_UNKNOWN;
        g_requestContextActive = false;
        g_responseActive = false;
        g_authLoggedForRequest = false;
        const uint32_t start = millis();
        g_server.handleClient();
        const uint32_t elapsed = millis() - start;
        if (elapsed > 250UL) {
            if (g_lastRequestMethod == METHOD_GET) {
                ESP32BASE_LOG_D("web", "slow_request method=%s uri=%s elapsed=%lu ms",
                                methodName(g_lastRequestMethod),
                                g_activeUri[0] ? g_activeUri : "(unknown)",
                                static_cast<unsigned long>(elapsed));
            } else {
                ESP32BASE_LOG_I("web", "slow_request method=%s uri=%s elapsed=%lu ms",
                                methodName(g_lastRequestMethod),
                                g_activeUri[0] ? g_activeUri : "(unknown)",
                                static_cast<unsigned long>(elapsed));
            }
        }
        g_requestContextActive = false;
        g_currentMethod = METHOD_UNKNOWN;
        g_responseActive = false;
    }
}

bool Esp32BaseWeb::isReady() {
    return g_webReady;
}

bool Esp32BaseWeb::startLocked() {
    return g_startLocked;
}

void Esp32BaseWeb::setDefaultAuth(const char* user, const char* pass) {
    if (!validAuthUser(user) || !validAuthPass(pass)) {
        ESP32BASE_LOG_W("web", "set_default_auth_failed reason=invalid");
        return;
    }
    strlcpy(g_defaultAuthUser, user, sizeof(g_defaultAuthUser));
    strlcpy(g_defaultAuthPass, pass, sizeof(g_defaultAuthPass));
    g_defaultAuthSet = true;
    g_startLocked = false;
    if (!g_authLoadedFromStorage) {
        applyDefaultAuth();
    }
    ESP32BASE_LOG_I("web", "default_auth_set user=%s password_set=%s applied=%s",
                    g_defaultAuthUser,
                    g_defaultAuthPass[0] ? "yes" : "no",
                    g_authLoadedFromStorage ? "no" : "yes");
}

bool Esp32BaseWeb::isAuthEnabled() {
    return g_authEnabled;
}

void Esp32BaseWeb::setAuthEnabled(bool enabled) {
    g_authEnabled = enabled;
    ESP32BASE_LOG_W("web", "auth_%s builtin_routes=%s",
                    enabled ? "enabled" : "disabled",
                    enabled ? "protected" : "open");
}

bool Esp32BaseWeb::checkAuth() {
    return ensureAuth();
}

