tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
bool Esp32BaseWeb::checkPostAllowed(const char* context) {
    return ensurePostAllowed(context);
}

bool Esp32BaseWeb::verifyAuth() {
    return isAuthenticated();
}

bool Esp32BaseWeb::verifyAuth(const char* user, const char* pass) {
    return authMatches(user, pass);
}

bool Esp32BaseWeb::saveAuth(const char* user, const char* pass) {
    if (!validAuthUser(user)) {
        ESP32BASE_LOG_W("web", "auth_update_failed reason=invalid_user");
        return false;
    }
    if (!validAuthPass(pass)) {
        ESP32BASE_LOG_W("web", "auth_update_failed reason=invalid_password");
        return false;
    }
    if (!saveStoredAuth(user, pass)) {
        ESP32BASE_LOG_W("web", "auth_update_failed reason=storage_failed");
        return false;
    }
    applyStoredAuth(user, pass);
    g_startLocked = false;
    ESP32BASE_LOG_I("web", "auth_saved user=%s password_set=%s",
                    g_authUser,
                    g_authPass[0] ? "yes" : "no");
    return true;
}

bool Esp32BaseWeb::resetAuth() {
    const bool ok = Esp32BaseConfig::clearNamespace("eb_web");
    const bool hasDefault = applyDefaultAuth();
    if (hasDefault) {
        g_startLocked = false;
        ESP32BASE_LOG_I("web", "auth_loaded user=%s password_set=%s source=default",
                        g_authUser,
                        g_authPass[0] ? "yes" : "no");
    } else {
        g_startLocked = true;
        ESP32BASE_LOG_W("web", "auth_default_missing action=auth_reset_locked");
    }
    ESP32BASE_LOG_I("web", "auth_reset");
    return ok && hasDefault;
}

bool Esp32BaseWeb::addRoute(const char* path, Method method, Handler handler) {
    if (!path || path[0] != '/' || !handler || strlen(path) >= sizeof(g_routes[0].path) ||
        (method != METHOD_GET && method != METHOD_POST && method != METHOD_ANY)) {
        return false;
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (!g_routes[i].handler) {
            strlcpy(g_routes[i].path, path, sizeof(g_routes[i].path));
            g_routes[i].title[0] = '\0';
            g_routes[i].method = method;
            g_routes[i].handler = handler;
            g_routes[i].appPage = false;
            if (g_webReady) {
                registerRoute(g_routes[i]);
            }
            return true;
        }
    }
    return false;
}

bool Esp32BaseWeb::addPage(const char* path, const char* title, Handler handler) {
    if (!path || path[0] != '/' || !title || !title[0] || !handler ||
        strlen(path) >= sizeof(g_routes[0].path) || strlen(title) >= sizeof(g_routes[0].title)) {
        return false;
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_ROUTES; ++i) {
        if (!g_routes[i].handler) {
            strlcpy(g_routes[i].path, path, sizeof(g_routes[i].path));
            strlcpy(g_routes[i].title, title, sizeof(g_routes[i].title));
            g_routes[i].method = METHOD_GET;
            g_routes[i].handler = handler;
            g_routes[i].appPage = true;
            if (g_webReady) {
                registerRoute(g_routes[i]);
            }
            ESP32BASE_LOG_D("web", "app_page_registered path=%s title=%s", g_routes[i].path, g_routes[i].title);
            return true;
        }
    }
    return false;
}

bool Esp32BaseWeb::addApi(const char* path, Handler handler) {
    return addRoute(path, METHOD_ANY, handler);
}

bool Esp32BaseWeb::addStaticAsset(const char* path, const char* contentType, const uint8_t* data, size_t len,
                                  uint32_t cacheMaxAgeSec, bool authRequired, bool gzipEncoded) {
    if (!path || path[0] != '/' || strlen(path) >= sizeof(g_staticAssets[0].path) ||
        !validHeaderValue(contentType, 63) || !data || len == 0 ||
        isBuiltinWebPath(path) || findStaticAsset(path) || findRoute(path, METHOD_GET) || findRoute(path, METHOD_ANY)) {
        return false;
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_STATIC_ASSETS; ++i) {
        if (!g_staticAssets[i].path[0]) {
            strlcpy(g_staticAssets[i].path, path, sizeof(g_staticAssets[i].path));
            g_staticAssets[i].contentType = contentType;
            g_staticAssets[i].data = data;
            g_staticAssets[i].len = len;
            g_staticAssets[i].cacheMaxAgeSec = cacheMaxAgeSec;
            g_staticAssets[i].authRequired = authRequired;
            g_staticAssets[i].gzipEncoded = gzipEncoded;
            g_staticAssets[i].registered = false;
            if (g_webReady) {
                registerStaticAsset(g_staticAssets[i]);
            }
            ESP32BASE_LOG_D("web", "static_asset_registered path=%s bytes=%lu cache=%lu auth=%s",
                            g_staticAssets[i].path,
                            static_cast<unsigned long>(len),
                            static_cast<unsigned long>(cacheMaxAgeSec),
                            authRequired ? "yes" : "no");
            return true;
        }
    }
    return false;
}

bool Esp32BaseWeb::addNavItem(const char* path, const char* title) {
    if (!path || path[0] != '/' || !title || !title[0] ||
        strlen(path) >= sizeof(g_navItems[0].path) || strlen(title) >= sizeof(g_navItems[0].title)) {
        return false;
    }
    for (uint8_t i = 0; i < ESP32BASE_WEB_MAX_NAV_ITEMS; ++i) {
        if (!g_navItems[i].path[0]) {
            strlcpy(g_navItems[i].path, path, sizeof(g_navItems[i].path));
            strlcpy(g_navItems[i].title, title, sizeof(g_navItems[i].title));
            ESP32BASE_LOG_D("web", "nav_item_registered path=%s title=%s", g_navItems[i].path, g_navItems[i].title);
            return true;
        }
    }
    return false;
}

bool Esp32BaseWeb::setDeviceName(const char* name) {
    if (!name || !name[0] || strlen(name) >= sizeof(g_deviceName)) {
        return false;
    }
    strlcpy(g_deviceName, name, sizeof(g_deviceName));
    return true;
}

bool Esp32BaseWeb::setHomePath(const char* path) {
    if (!path || path[0] != '/' || strlen(path) >= sizeof(g_homePath)) {
        return false;
    }
    strlcpy(g_homePath, path, sizeof(g_homePath));
    return true;
}

void Esp32BaseWeb::setHomeMode(HomeMode mode) {
    if (mode == HOME_ESP32BASE || mode == HOME_APP || mode == HOME_COMBINED) {
        g_homeMode = mode;
    }
}

void Esp32BaseWeb::setSystemNavMode(SystemNavMode mode) {
    if (mode == SYSTEM_NAV_TOP || mode == SYSTEM_NAV_BOTTOM || mode == SYSTEM_NAV_SECTION) {
        g_systemNavMode = mode;
    }
}

