tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
bool Esp32BaseWeb::setFooterBarMode(FooterBarMode mode) {
    if (!validFooterBarMode(mode)) {
        return false;
    }
    const FooterBarMode previousMode = g_footerBarMode;
    g_footerBarMode = mode;
    const bool saved = Esp32BaseConfig::setInt("eb_ui", "footer_mode", static_cast<int32_t>(mode));
    ESP32BASE_LOG_W("web", "footer_bar_mode_%s from=%s to=%s saved=%s",
                    previousMode == mode ? "unchanged" : "changed",
                    ::footerBarModeName(previousMode),
                    ::footerBarModeName(mode),
                    saved ? "success" : "failed");
    return saved;
}

Esp32BaseWeb::FooterBarMode Esp32BaseWeb::footerBarMode() {
    return g_footerBarMode;
}

const char* Esp32BaseWeb::footerBarModeName() {
    return ::footerBarModeName(g_footerBarMode);
}

bool Esp32BaseWeb::setBuiltinLabel(BuiltinPage page, const char* label) {
    if (page > BUILTIN_AUTH || !label || !label[0] || strlen(label) >= sizeof(g_builtinLabels[0])) {
        return false;
    }
    strlcpy(g_builtinLabels[page], label, sizeof(g_builtinLabels[page]));
    return true;
}

void Esp32BaseWeb::setHeadExtraCallback(Handler handler) {
    g_headExtraCallback = handler;
}

Esp32BaseWeb::Method Esp32BaseWeb::currentMethod() {
    return g_requestContextActive ? g_currentMethod : METHOD_UNKNOWN;
}

bool Esp32BaseWeb::isMethod(Method method) {
    const Method current = currentMethod();
    if (method == METHOD_ANY) {
        return current != METHOD_UNKNOWN;
    }
    return current == method;
}

const char* Esp32BaseWeb::currentMethodName() {
    return methodName(currentMethod());
}

bool Esp32BaseWeb::hasParam(const char* name) {
    return name && g_server.hasArg(name);
}

bool Esp32BaseWeb::getParam(const char* name, char* out, size_t len) {
    if (!name || !out || len == 0 || !g_server.hasArg(name)) {
        return false;
    }
    const String value = g_server.arg(name);
    return strlcpy(out, value.c_str(), len) < len;
}

bool Esp32BaseWeb::getRequestBody(char* out, size_t len) {
    if (!out || len == 0) {
        return false;
    }
    const String value = g_server.arg("plain");
    return strlcpy(out, value.c_str(), len) < len;
}

void Esp32BaseWeb::sendHeader(const char* title) {
    if (!beginResponse(200, "text/html; charset=utf-8", nullptr)) {
        return;
    }
    sendChunk("<!doctype html><html><head><title>");
    sendEscapedHtmlChunk(title ? title : g_deviceName);
    sendChunk("</title>");
    sendProgmem(WEB_HEAD);
    if (g_pageHeadProgmem) {
        sendProgmem(g_pageHeadProgmem);
        g_pageHeadProgmem = nullptr;
    }
    if (shouldSendHeadExtra()) {
        g_headExtraCallback();
    }
    sendChunk("</head><body>");
    sendMainNav();
    sendChunk("<main class='page'>");
}

void Esp32BaseWeb::sendFooter() {
    sendChunk("</main>");
    if (g_systemNavMode != Esp32BaseWeb::SYSTEM_NAV_SECTION) {
        sendSystemNavSection();
    }
    switch (g_footerBarMode) {
        case Esp32BaseWeb::FOOTER_BAR_OFF:
            sendChunk("</body></html>");
            break;
        case Esp32BaseWeb::FOOTER_BAR_STATUS_ONLY:
            sendChunk("<footer class='footerbar'><span class='heap'>");
            sendFooterStats();
            sendChunk("</span></footer></body></html>");
            break;
        case Esp32BaseWeb::FOOTER_BAR_FULL:
        default:
            if (g_systemNavMode == Esp32BaseWeb::SYSTEM_NAV_SECTION) {
                sendChunk("<footer class='footerbar'><span class='syslinks'>");
                sendSystemLinks(false, activeNavPath(true));
                sendChunk("</span><span class='heap'>");
                sendFooterStats();
                sendChunk("</span></footer></body></html>");
            } else {
                sendChunk("<div class=info>");
                sendFooterStats();
                sendChunk("</div></body></html>");
            }
            break;
    }
    endResponse();
}

void Esp32BaseWeb::sendPageTitle(const char* title, const char* subtitle) {
    sendChunk("<header class='pagehead'><h1>");
    writeHtmlEscaped(title ? title : "");
    sendChunk("</h1>");
    if (subtitle && subtitle[0]) {
        sendChunk("<p>");
        writeHtmlEscaped(subtitle);
        sendChunk("</p>");
    }
    sendChunk("</header>");
}

void Esp32BaseWeb::beginPanel(const char* title) {
    sendChunk("<section class='panel'>");
    if (title && title[0]) {
        sendChunk("<h2>");
        writeHtmlEscaped(title);
        sendChunk("</h2>");
    }
}

void Esp32BaseWeb::endPanel() {
    sendChunk("</section>");
}

void Esp32BaseWeb::sendNotice(UiTone tone, const char* title, const char* message) {
    sendChunk("<div class='notice");
    sendChunk(uiToneClass(tone));
    sendChunk("'><b>");
    writeHtmlEscaped(title ? title : "");
    sendChunk("</b>");
    if (message && message[0]) {
        sendChunk("<br>");
        writeHtmlEscaped(message);
    }
    sendChunk("</div>");
}

void Esp32BaseWeb::sendResultNotice(const ResultNotice* notices, uint8_t count) {
    if (!notices || count == 0) {
        return;
    }
    char value[32];
    for (uint8_t i = 0; i < count; ++i) {
        const ResultNotice& notice = notices[i];
        if (!notice.param || !notice.param[0]) {
            continue;
        }
        if (!hasParam(notice.param)) {
            continue;
        }
        if (notice.value && notice.value[0]) {
            if (!getParam(notice.param, value, sizeof(value)) || strcmp(value, notice.value) != 0) {
                continue;
            }
        }
        sendNotice(notice.tone, notice.title, notice.message);
        return;
    }
}

void Esp32BaseWeb::beginMetricGrid() {
    sendChunk("<div class='metrics'>");
}

void Esp32BaseWeb::sendMetric(const char* label, const char* value, const char* help) {
    sendChunk("<div class='metric'><b>");
    writeHtmlEscaped(value ? value : "");
    sendChunk("</b><span>");
    writeHtmlEscaped(label ? label : "");
    if (help && help[0]) {
        sendChunk(" · ");
        writeHtmlEscaped(help);
    }
    sendChunk("</span></div>");
}

void Esp32BaseWeb::endMetricGrid() {
    sendChunk("</div>");
}

static bool sendInfoRowCompactStart(const char* title, const char* help, const char* value, bool hasAction) {
    sendChunk("<div class='urow'><div><b>");
    sendEscapedHtmlChunk(title ? title : "");
    sendChunk("</b>");
    if (help && help[0]) {
        sendChunk("<small>");
        sendEscapedHtmlChunk(help);
        sendChunk("</small>");
    }
    sendChunk(hasAction ? "</div><div class='uactions'>" : "</div><div class='uactions readonly'>");
    const bool hasValue = value && value[0];
    if (hasValue) {
        sendChunk("<span class='uvalue'>");
        sendEscapedHtmlChunk(value);
        sendChunk("</span>");
    } else if (hasAction) {
        sendChunk("<span class='uvalue empty'></span>");
    }
    return hasValue;
}

static void sendInfoRowCompactEnd() {
    sendChunk("</div></div>");
}

static void sendInfoRowActionGap(bool hasValue) {
    (void)hasValue;
}

static void sendInfoRowActionLink(const char* href, const char* label, Esp32BaseWeb::UiTone tone) {
    sendChunk("<a class='btnlink");
    sendChunk(uiToneClass(tone));
    sendChunk("' href='");
    sendEscapedHtmlChunk(href ? href : "#");
    sendChunk("'>");
    sendEscapedHtmlChunk(label ? label : "");
    sendChunk("</a>");
}

void Esp32BaseWeb::sendInfoRowCompact(const char* title, const char* help, const char* value) {
    sendInfoRowCompactStart(title, help, value, false);
    sendInfoRowCompactEnd();
}

