tangyangguang/Esp32Base/src/web/Esp32BaseWeb.cpp
void Esp32BaseWeb::sendInfoRowCompactLink(const char* title, const char* help, const char* value,
                                          const char* href, const char* label, UiTone tone) {
    const bool hasValue = sendInfoRowCompactStart(title, help, value, true);
    sendInfoRowActionGap(hasValue);
    sendInfoRowActionLink(href, label, tone);
    sendInfoRowCompactEnd();
}

void Esp32BaseWeb::sendInfoRowCompactForm(const char* title, const char* help, const char* value,
                                          const char* action, const char* label,
                                          const char* hiddenName, const char* hiddenValue,
                                          UiTone tone) {
    const bool hasValue = sendInfoRowCompactStart(title, help, value, true);
    sendInfoRowActionGap(hasValue);
    sendChunk("<form method='post' action='");
    sendEscapedHtmlChunk(action ? action : "");
    sendChunk("' onsubmit='return once(this)'>");
    if (hiddenName && hiddenName[0]) {
        sendChunk("<input type='hidden' name='");
        sendEscapedHtmlChunk(hiddenName);
        sendChunk("' value='");
        sendEscapedHtmlChunk(hiddenValue ? hiddenValue : "");
        sendChunk("'>");
    }
    sendChunk("<input type='submit' class='btnlink");
    sendChunk(uiToneClass(tone));
    sendChunk("'");
    sendChunk(" value='");
    sendEscapedHtmlChunk(label ? label : "");
    sendChunk("'></form>");
    sendInfoRowCompactEnd();
}

void Esp32BaseWeb::sendInfoRowInlineEdit(const char* id, const char* title, const char* help, const char* value,
                                         const char* action, const char* inputName, const char* inputValue,
                                         const char* label, UiTone tone) {
    const char* rowId = id && id[0] ? id : "eb-inline-row";
    sendChunk("<div id='");
    sendEscapedHtmlChunk(rowId);
    sendChunk("'>");
    sendInfoRowCompactStart(title, help, value, true);
    sendChunk("<button type='button' class='btnlink");
    sendChunk(uiToneClass(tone));
    sendChunk("' data-eb-inline-toggle='");
    sendEscapedHtmlChunk(rowId);
    sendChunk("-edit'>");
    sendEscapedHtmlChunk(label ? label : "Edit");
    sendChunk("</button>");
    sendInfoRowCompactEnd();
    sendChunk("<div id='");
    sendEscapedHtmlChunk(rowId);
    sendChunk("-edit' class='eb-inline-edit'><form method='post' data-eb-ajax action='");
    sendEscapedHtmlChunk(action ? action : "");
    sendChunk("'><label>");
    sendEscapedHtmlChunk(title ? title : "");
    sendChunk("</label><input name='");
    sendEscapedHtmlChunk(inputName ? inputName : "value");
    sendChunk("' value='");
    sendEscapedHtmlChunk(inputValue ? inputValue : "");
    sendChunk("' autocomplete='off'><div data-eb-error class='eb-inline-error'></div><div class='actions'><button type='button' class='secondary' data-eb-inline-close='");
    sendEscapedHtmlChunk(rowId);
    sendChunk("-edit'>Cancel</button><input type='submit' value='Save'></div></form></div></div>");
}

void Esp32BaseWeb::sendInfoRowDialogForm(const char* dialogId, const char* targetId, const char* title,
                                         const char* help, const char* value, const char* action,
                                         const char* fieldsHtml, const char* label, UiTone tone) {
    const char* id = dialogId && dialogId[0] ? dialogId : "eb-dialog";
    sendChunk("<div id='");
    sendEscapedHtmlChunk(targetId && targetId[0] ? targetId : id);
    sendChunk("'>");
    sendInfoRowCompactStart(title, help, value, true);
    sendChunk("<button type='button' class='btnlink");
    sendChunk(uiToneClass(tone));
    sendChunk("' data-eb-dialog-open='");
    sendEscapedHtmlChunk(id);
    sendChunk("'>");
    sendEscapedHtmlChunk(label ? label : "Edit");
    sendChunk("</button>");
    sendInfoRowCompactEnd();
    sendChunk("</div><div id='");
    sendEscapedHtmlChunk(id);
    sendChunk("' class='eb-dialog-backdrop'><div class='eb-dialog'><button type='button' class='eb-dialog-close' data-eb-dialog-close>Close</button><h2>");
    sendEscapedHtmlChunk(title ? title : "");
    sendChunk("</h2><form method='post' data-eb-ajax action='");
    sendEscapedHtmlChunk(action ? action : "");
    sendChunk("'>");
    if (fieldsHtml && fieldsHtml[0]) {
        sendChunk(fieldsHtml);
    }
    sendChunk("<div data-eb-error class='eb-dialog-error'></div><div class='actions'><button type='button' class='secondary' data-eb-dialog-close>Cancel</button><input type='submit' value='Save'></div></form></div></div>");
}

bool Esp32BaseWeb::isAjaxRequest() {
    return g_server.header("X-Esp32Base-Ajax") == "1";
}

static const char* ajaxToneName(Esp32BaseWeb::UiTone tone) {
    switch (tone) {
        case Esp32BaseWeb::UI_OK: return "ok";
        case Esp32BaseWeb::UI_WARN: return "warn";
        case Esp32BaseWeb::UI_DANGER: return "danger";
        case Esp32BaseWeb::UI_INFO: return "info";
        case Esp32BaseWeb::UI_NEUTRAL:
        default: return "neutral";
    }
}

void Esp32BaseWeb::sendAjaxReplace(const char* targetId, const char* html, const char* noticeTitle,
                                   UiTone tone, bool close) {
    if (!beginResponse(200, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"ok\":true,\"target\":\"");
    sendEscapedJsonChunk(targetId ? targetId : "");
    sendChunk("\",\"html\":\"");
    sendEscapedJsonChunk(html ? html : "");
    sendChunk("\"");
    if (noticeTitle && noticeTitle[0]) {
        sendChunk(",\"notice\":{\"tone\":\"");
        sendChunk(ajaxToneName(tone));
        sendChunk("\",\"title\":\"");
        sendEscapedJsonChunk(noticeTitle);
        sendChunk("\"}");
    }
    sendChunk(",\"close\":");
    sendChunk(close ? "true" : "false");
    sendChunk("}");
    endResponse();
}

void Esp32BaseWeb::sendAjaxError(int code, const char* error) {
    if (!beginResponse(code, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"ok\":false,\"error\":\"");
    sendEscapedJsonChunk(error ? error : "Action failed");
    sendChunk("\"}");
    endResponse();
}

void Esp32BaseWeb::sendPagination(const Pagination& pagination) {
    const uint32_t perPage = pagination.perPage == 0 ? 10 : pagination.perPage;
    const uint32_t totalPages = pagination.total == 0 ? 1 : ((pagination.total + perPage - 1) / perPage);
    uint32_t page = pagination.page == 0 ? 1 : pagination.page;
    if (page > totalPages) {
        page = totalPages;
    }
    char left[64];
    snprintf(left, sizeof(left), "共 %lu 条 / %lu 页",
             static_cast<unsigned long>(pagination.total),
             static_cast<unsigned long>(totalPages));
    sendChunk("<div class='pagination'><span class='muted'>");
    writeHtmlEscaped(left);
    sendChunk("</span><span class='pagerlinks'>");
    sendPaginationLink("首页", pagination, 1, page <= 1);
    sendPaginationLink("上一页", pagination, page > 1 ? page - 1 : 1, page <= 1);
    uint32_t startPage = page > 2 ? page - 2 : 1;
    uint32_t endPage = startPage + 4;
    if (endPage > totalPages) {
        endPage = totalPages;
    }
    if (endPage >= 4 && endPage - startPage < 4) {
        startPage = endPage > 4 ? endPage - 4 : 1;
    }
    for (uint32_t i = startPage; i <= endPage; ++i) {
        sendPaginationPageNumber(pagination, i, page);
    }
    sendPaginationLink("下一页", pagination, page < totalPages ? page + 1 : totalPages, page >= totalPages);
    sendPaginationLink("尾页", pagination, totalPages, page >= totalPages);
    sendChunk("</span><form method='get' class='pagerform'");
    sendPaginationActionPath(pagination.path);
    sendChunk(">");
    const char* pathQuery = pagination.path ? strchr(pagination.path, '?') : nullptr;
    sendQueryHiddenInputs(pathQuery ? pathQuery + 1 : nullptr);
    sendQueryHiddenInputs(pagination.query);
    sendChunk("<label class='muted'>每页</label><select name='per'>");
    const uint16_t options[] = {10, 15, 20, 30, 50};
    for (uint8_t i = 0; i < 5; ++i) {
        char opt[8];
        snprintf(opt, sizeof(opt), "%u", static_cast<unsigned>(options[i]));
        sendChunk("<option value='");
        sendChunk(opt);
        if (perPage == options[i]) {
            sendChunk("' selected>");
        } else {
            sendChunk("'>");
        }
        sendChunk(opt);
        sendChunk("</option>");
    }
    char pageValue[16];
    char totalValue[16];
    snprintf(pageValue, sizeof(pageValue), "%lu", static_cast<unsigned long>(page));
    snprintf(totalValue, sizeof(totalValue), "%lu", static_cast<unsigned long>(totalPages));
    sendChunk("</select><label class='muted'>跳至</label><input type='number' name='page' min='1' max='");
    sendChunk(totalValue);
    sendChunk("' value='");
    sendChunk(pageValue);
    sendChunk("'><button type='submit'>跳转</button></form></div>");
}

